Repository: Armand-Duval/VocabFlow
Catalog: Shared/Localization/Localizable.xcstrings
Source language: en
Languages: zh_hans

# account.apple.cancelled
source: Apple sign in was cancelled.
zh_hans: 已取消 Apple 登录。

# account.apple.missingCredential
source: Could not read Apple ID credential.
zh_hans: 无法读取 Apple 登录凭证。

# account.apple.missingToken
source: Missing identity token from Apple.
zh_hans: Apple 未返回 identity token。

# account.apple.unavailable
source: Apple Sign In isn’t available on this build yet.
zh_hans: 当前版本暂未开启 Apple 登录。

# account.invalidData
source: Stored account data is invalid.
zh_hans: 账号数据无效。

# account.keychain.error
source: Keychain error (%ld).
zh_hans: 钥匙串错误（%ld）。

# account.provider.apple
source: Apple ID
zh_hans: Apple 账号

# account.provider.wechat
source: WeChat
zh_hans: 微信

# account.signedOut.message
source: Sync your profile across devices after signing in.
zh_hans: 登录后可同步账号信息（词库仍保存在本机）。

# account.signedOut.title
source: Sign in
zh_hans: 登录账号

# account.signIn.apple
source: Sign in with Apple
zh_hans: 通过 Apple 登录

# account.signIn.failed
source: Sign in failed
zh_hans: 登录失败

# account.signIn.wechat
source: Sign in with WeChat
zh_hans: 微信登录

# account.signOut
source: Sign out
zh_hans: 退出登录

# account.wechat.backendFailed
source: WeChat backend error: %@
zh_hans: 微信登录服务端错误：%@

# account.wechat.backendRequired
source: WeChat sign-in isn’t ready yet. Please try again later.
zh_hans: 微信登录暂未就绪，请稍后再试。

# account.wechat.missingCode
source: WeChat did not return an authorization code.
zh_hans: 微信未返回授权 code。

# account.wechat.notConfigured
source: WeChat sign-in isn’t configured yet.
zh_hans: 微信登录尚未配置完成。

# account.wechat.notInstalled
source: WeChat is not installed on this device.
zh_hans: 未安装微信客户端。

# account.wechat.sdkNotLinked
source: WeChat sign-in isn’t available in this build.
zh_hans: 当前版本暂不支持微信登录。

# apkg.export.empty
source: No cards to export
zh_hans: 没有可导出的卡片

# apkg.export.failed
source: Export failed: %@
zh_hans: 导出失败：%@

# apkg.export.zipFailed
source: Could not create archive
zh_hans: 无法创建压缩包

# apkg.import.empty
source: No importable cards found
zh_hans: 未找到可导入的卡片

# apkg.import.failed
source: Import failed: %@
zh_hans: 导入失败：%@

# apkg.import.invalid
source: Invalid Anki package
zh_hans: 无效的 Anki 包

# apkg.import.missingCollection
source: Could not find Anki collection in package
zh_hans: 包内找不到 Anki 数据库

# backup.reminder.body
source: Export a JSON backup from Decks to keep your progress safe.
zh_hans: 请在「词库包」页导出 JSON 备份，以免学习进度丢失。

# backup.reminder.title
source: Time to back up your cards
zh_hans: 该备份词库了

# brand.name
source: KnoWell
zh_hans: 致知

# brand.name.action
source: KnoWell Create
zh_hans: 致知制卡

# card.antonyms
source: Antonyms
zh_hans: 反义词

# card.antonyms.placeholder
source: listener · audience
zh_hans: listener · audience（用 · 分隔）

# card.etymology
source: Word parts
zh_hans: 词根构词

# card.etymology.placeholder
source: Root / affix breakdown (optional)
zh_hans: 词根/词缀拆解（可选）

# card.export.apkg
source: Export as apkg
zh_hans: 导出 apkg

# card.paraphrases
source: Model sentences
zh_hans: 仿写例句

# card.paraphrases.placeholder
source: 【Academic】She is a gifted orator who… (Optional Chinese tip)
zh_hans: 【学术写作】She is a gifted orator who… （可选中文提示）

# card.regenerate
source: Regenerate with AI
zh_hans: AI 重新生成

# card.regenerate.done
source: Card regenerated
zh_hans: 已重新生成

# card.regenerate.editMessage
source: Fill the form with the latest AI output. Review and tweak, then tap Done to save. Progress and deck stay the same.
zh_hans: 将用最新 AI 结果填入表单，可再微调后点完成保存。复习进度与牌组保留。

# card.regenerate.message
source: Rebuild this card with the latest AI rules. Review progress and deck stay the same.
zh_hans: 用最新 AI 制卡规则重生成此卡内容，复习进度与牌组保留。

# card.regenerate.noMatch
source: AI returned no matching card. Check the word and sentence.
zh_hans: AI 未返回匹配卡片，请检查单词与原句。

# card.regenerate.running
source: Regenerating…
zh_hans: 正在重新生成…

# card.sentenceTranslation
source: Sentence translation
zh_hans: 句子翻译

# card.source
source: Source
zh_hans: 出处

# card.source.value
source: Source · %@
zh_hans: 出处 · %@

# card.sourceImage
source: Source image
zh_hans: 原图

# card.sourceImage.add
source: Add source image
zh_hans: 添加原图

# card.sourceImage.expandHint
source: Tap to enlarge. Pinch or tap again to zoom out.
zh_hans: 点按放大；捏合或再点可缩小。

# card.sourceImage.remove
source: Remove
zh_hans: 移除

# card.sourceImage.replace
source: Replace
zh_hans: 更换

# card.suspend
source: Suspend review
zh_hans: 暂停复习

# card.suspended.done
source: Card suspended
zh_hans: 已暂停复习

# card.suspended.hint
source: This card is suspended and won't appear in review queues.
zh_hans: 此卡片已暂停，不会进入复习队列。

# card.suspended.status
source: Suspended
zh_hans: 已暂停

# card.synonyms
source: Synonyms
zh_hans: 同义词

# card.synonyms.placeholder
source: speaker · rhetorician
zh_hans: speaker · rhetorician（用 · 分隔）

# card.translationHighlight
source: Highlight gloss
zh_hans: 高亮译法

# card.translationHighlight.footer
source: Enter only the short gloss for the target word (e.g. “leave”). Do not mark the whole sentence. It will be highlighted during review.
zh_hans: 只填目标词对应的短译法（如「离开」），不要标整句。复习时会高亮显示。

# card.translationHighlight.missing
source: That gloss was not found in the translation. Shorten it or match the wording.
zh_hans: 译文中未找到该片段，请缩短或改成译文里的原词。

# card.translationHighlight.preview
source: Preview
zh_hans: 预览

# card.unsuspend
source: Resume review
zh_hans: 恢复复习

# card.unsuspended.done
source: Card resumed
zh_hans: 已恢复复习

# card.usageNote
source: Usage insight
zh_hans: 用法洞察

# card.usageNote.placeholder
source: Why this word here; contrast with alternatives…
zh_hans: 为何此处用此词；与近义/替代词对比…

# cardType.appreciation
source: Appreciation
zh_hans: 赏析

# cardType.cloze
source: Cloze
zh_hans: 挖空

# cardType.definition
source: Definition
zh_hans: 释义

# cloud.quota.exhausted
source: Today's free AI quota is used up.
zh_hans: 今日免费额度已用完

# cloud.quota.insufficient
source: This job needs %d words, but only %d remain today.
zh_hans: 这次要制 %d 个生词，今日额度还剩 %d。

# cloud.quota.remaining
source: %d / %d free AI words left today
zh_hans: 今日免费额度还剩 %d / %d 个生词

# common.add
source: Add
zh_hans: 添加

# common.back
source: Back
zh_hans: 返回

# common.cancel
source: Cancel
zh_hans: 取消

# common.clear
source: Clear
zh_hans: 清空

# common.close
source: Close
zh_hans: 关闭

# common.done
source: Done
zh_hans: 完成

# common.ok
source: OK
zh_hans: 好

# create.addSelection
source: Add to vocabulary
zh_hans: 加入生词

# create.addSelection.word
source: Add: %@
zh_hans: 加入生词：%@

# create.addWord
source: Add word
zh_hans: 添加生词

# create.aiGenerate
source: Generate cards
zh_hans: 生成卡片

# create.appreciation.detail
source: Paste a sentence you want to keep. AI writes a literary appreciation card — no word picking.
zh_hans: 粘贴想收藏的句子，AI 生成赏析卡（无需选生词）。

# create.appreciation.generate
source: Generate appreciation
zh_hans: 生成赏析卡

# create.appreciation.generating
source: Writing appreciation…
zh_hans: 正在生成赏析…

# create.appreciation.placeholder
source: Paste a line worth keeping…
zh_hans: 粘贴想留住的句子…

# create.appreciation.source
source: Source (optional)
zh_hans: 出处（可选）

# create.appreciation.sourcePlaceholder
source: Book, author, or article
zh_hans: 书名、作者或文章来源

# create.captureToday
source: Today you saved %1$lld words · %2$lld lines
zh_hans: 今天收录了 %1$lld 个词 · %2$lld 句

# create.cardRecommended.badge
source: AI pick
zh_hans: AI 推荐

# create.defaultKey
source: Using built-in default API key
zh_hans: 当前使用内置默认 API Key

# create.empty.hint
source: Import from a photo or the clipboard, then AI makes review cards.
zh_hans: 从照片或剪贴板导入，AI 生成记忆卡片。

# create.error.dailyQuota
source: Today's free AI quota is used up. Try again tomorrow, or add your own API key in Settings.
zh_hans: 今日免费额度已用完。明天再试，或在设置里填入自己的 API 密钥。

# create.error.empty
source: Enter a source sentence and at least one word.
zh_hans: 请填写原句，并至少输入一个生词。

# create.error.emptyAppreciation
source: The appreciation text wasn't generated. Try again.
zh_hans: 赏析正文没有生成，请再试一次。

# create.error.formatDetail
source: The model returned an incomplete reply. Try fewer words or generate again.
zh_hans: 模型返回不完整，导致格式解析失败。可少选生词或再试一次。

# create.error.timeout
source: Generation timed out. Try fewer words, or tap Generate again.
zh_hans: 生成超时。可少选几个生词后重试，或再点一次生成。

# create.error.title
source: Could Not Generate
zh_hans: 无法生成

# create.generate
source: Generate Cards
zh_hans: 生成卡片

# create.generate.allDuplicates
source: These words already have cards for this sentence in the selected deck.
zh_hans: 所选词库中已有这些词的同句卡片，无需再生成。

# create.generate.hint
source: Add source text and at least one word to generate cards.
zh_hans: 请先输入原文并添加至少一个生词。

# create.generate.hintEmpty
source: Paste or scan a sentence to get started.
zh_hans: 请粘贴或扫描句子。

# create.generate.needBoth
source: Add a sentence and at least one word
zh_hans: 先填写原文，并加入至少一个词

# create.generate.needSentence
source: Add the source sentence first
zh_hans: 先填写原文

# create.generate.needWords
source: Add at least one word to learn
zh_hans: 再加入至少一个要学的词

# create.generate.noWordsHint
source: No words selected — AI will create an appreciation card for the sentence.
zh_hans: 未选生词，将生成句子赏析卡。

# create.generate.short
source: Generate
zh_hans: 生成

# create.generate.success
source: Generated %d cards
zh_hans: 已生成 %d 张卡片

# create.generate.successSkipped
source: Generated %1$lld cards, skipped %2$lld already in deck
zh_hans: 已生成 %1$lld 张，跳过 %2$lld 个词库中已有

# create.generating
source: Generating...
zh_hans: 生成中...

# create.generating.progress
source: Generating %lld / %lld batches…
zh_hans: 生成中 %lld / %lld 批…

# create.literaryLead
source: Bring a line that stayed with you — I’ll help you keep it.
zh_hans: 放下一句想留住的话，我帮你收进可复习的卡片。

# create.longText.keepSentence
source: Keep as one passage
zh_hans: 保留整段

# create.longText.message
source: This passage is quite long. Keep it as one sentence or try extracting vocabulary?
zh_hans: 这段文字较长。保留为整段原文，还是尝试提取生词？

# create.longText.splitFallback
source: Could not auto-extract words. Select text manually.
zh_hans: 未能自动提取生词，请在原文中手动选中。

# create.longText.splitWords
source: Try extract words
zh_hans: 尝试提取生词

# create.longText.title
source: Long text
zh_hans: 长文本提示

# create.manageDeck
source: Manage decks
zh_hans: 管理词库

# create.paste.empty
source: Clipboard is empty
zh_hans: 剪贴板是空的

# create.paste.short
source: Paste
zh_hans: 粘贴

# create.pastePlaceholder
source: Paste a line you want to remember
zh_hans: 粘贴想留下的句子

# create.pending.action
source: Review
zh_hans: 查看

# create.pending.draftsSubtitle
source: %d cards ready to review
zh_hans: %d 张卡片待确认

# create.pending.importTitle
source: Shared content ready
zh_hans: 待制作卡片

# create.photo.short
source: Album
zh_hans: 相册

# create.phrasePicker.boundaryEnd
source: Adjust end
zh_hans: 调整终点

# create.phrasePicker.boundaryHint
source: Drag end dots to adjust
zh_hans: 拖两端圆点调整

# create.phrasePicker.boundaryStart
source: Adjust start
zh_hans: 调整起点

# create.phrasePicker.hint
source: Drag to select a phrase, then tap Add. Tap Cancel to clear. Drag the end dots to adjust bounds.
zh_hans: 拖选短语后点「加入」确认；点「取消」可放弃。两端圆点可改边界。

# create.phrasePicker.title
source: Pick phrases in the sentence
zh_hans: 在原句中圈选短语

# create.preview.doneAction
source: Done
zh_hans: 完成

# create.preview.doneEmpty
source: No cards kept
zh_hans: 没有留下卡片

# create.preview.doneTitle
source: Saved
zh_hans: 已保存

# create.preview.drop
source: Drop
zh_hans: 丢掉

# create.preview.footerCompact
source: Cards marked AI pick are selected by default. Turn on Include to save optional alternates.
zh_hans: 带「AI 推荐」标签的卡片默认入库；另一种类型可手动打开「加入词库」。

# create.preview.keep
source: Keep
zh_hans: 留下

# create.preview.later
source: Later
zh_hans: 稍后

# create.preview.moreWaiting
source: %lld more waiting after this batch
zh_hans: 这批之后还有 %lld 张待确认

# create.preview.replace
source: Replace
zh_hans: 换一张

# create.preview.replace.title
source: What should change?
zh_hans: 哪里不满意

# create.preview.replace.tooEasy
source: Too easy
zh_hans: 太浅

# create.preview.replace.tooHard
source: Too hard
zh_hans: 太难

# create.preview.replace.wrongSense
source: Wrong sense
zh_hans: 义项不对

# create.preview.replacing
source: Replacing…
zh_hans: 正在换一张…

# create.preview.reveal
source: Tap to see the back
zh_hans: 点按查看背面

# create.preview.reviewNow
source: Review %lld cards
zh_hans: 去复习这 %lld 张

# create.preview.sectionCards
source: Generated cards
zh_hans: 生成的卡片

# create.preview.tapHint
source: Check the front first — keep only cards you can study.
zh_hans: 先看正面，只留下能背的卡。

# create.queue.bannerMany
source: %lld jobs in queue
zh_hans: 队列中有 %lld 个任务

# create.queue.bannerOne
source: Generating cards…
zh_hans: 正在生成卡片…

# create.queue.clearFinished
source: Clear Finished
zh_hans: 清除已完成

# create.queue.emptyBody
source: New card jobs appear here with per-word progress.
zh_hans: 新的制卡任务会显示在这里，并可查看每个词的进度。

# create.queue.emptyTitle
source: No jobs yet
zh_hans: 暂无任务

# create.queue.enqueued
source: Added to generation queue
zh_hans: 已加入制卡队列

# create.queue.skipped
source: %lld duplicate(s) skipped
zh_hans: 已跳过 %lld 个重复词

# create.queue.status.failed
source: Failed
zh_hans: 失败

# create.queue.status.queued
source: Queued
zh_hans: 排队中

# create.queue.status.running
source: Running
zh_hans: 生成中

# create.queue.status.succeeded
source: Done
zh_hans: 已完成

# create.queue.title
source: Generation Queue
zh_hans: 制卡队列

# create.queue.viewAction
source: View
zh_hans: 查看

# create.queue.word.done
source: Ready
zh_hans: 完成

# create.queue.word.failed
source: Failed
zh_hans: 失败

# create.queue.word.pending
source: Waiting
zh_hans: 等待

# create.queue.word.running
source: Generating
zh_hans: 生成中

# create.queue.word.skipped
source: Skipped
zh_hans: 已跳过

# create.quick.camera
source: Camera
zh_hans: 拍照

# create.quick.pending
source: Pending
zh_hans: 待制卡

# create.quick.photo
source: Album
zh_hans: 相册

# create.quickCapture.paste
source: Paste text
zh_hans: 粘贴句子

# create.quickCapture.title
source: Quick capture
zh_hans: 快速收录

# create.scan.emptyHint
source: Camera first, album and paste stay one tap away.
zh_hans: 先拍再摘；相册与粘贴仍在同一屏。

# create.scan.excerpt
source: Scan excerpt
zh_hans: 扫描摘录

# create.scan.openCamera
source: Open camera
zh_hans: 打开相机

# create.scan.ritualSubtitle
source: Snap a marked page and turn highlights into review cards.
zh_hans: 拍下划过的书页，把高亮摘录收成可复习的卡片。

# create.scan.ritualTitle
source: Photo → cards
zh_hans: 拍书页 → 出卡

# create.scan.short
source: Scan
zh_hans: 扫描

# create.scan.step.card
source: Card
zh_hans: 出卡

# create.scan.step.extract
source: Excerpt
zh_hans: 摘录

# create.scan.step.photo
source: Page
zh_hans: 书页

# create.source
source: Source Text
zh_hans: 原文

# create.source.charCount
source: %d chars
zh_hans: %d 字

# create.source.emptyHint
source: Paste or type a sentence…
zh_hans: 粘贴或输入句子…

# create.source.footer
source: Drag to select text, then add it as vocabulary. Safari supports Share; for Apple Books and similar apps, copy text and open KnoWell.
zh_hans: 拖选文字后点「加入生词」，或长按选区菜单选择。Safari 可分享导入；Apple Books、番茄小说等请复制文字后打开 App，会自动填入。

# create.source.footerHint
source: Select words in the text to add them as vocabulary.
zh_hans: 在原文中选中单词即可快速添加为生词。

# create.source.longHint
source: Long text detected. Consider selecting words manually or splitting into batches.
zh_hans: 检测到较长文本，建议手动选中生词或分段制卡。

# create.source.placeholder
source: Paste or type a sentence…
zh_hans: 粘贴或输入句子…

# create.sourceMode.edit
source: Edit text
zh_hans: 编辑原文

# create.sourceMode.pick
source: Pick phrases
zh_hans: 圈选短语

# create.tip.body
source: Drag to select words in the source text, then tap Add to Vocabulary. You can also type words manually below.
zh_hans: 在原文中拖选文字，点「加入生词」；也可在下方手动输入。Safari 可分享导入，其他 App 可复制后打开本应用。

# create.tip.dismiss
source: Got it
zh_hans: 知道了

# create.tip.title
source: Quick start
zh_hans: 快速上手

# create.title
source: Create
zh_hans: 制卡

# create.words
source: Words
zh_hans: 生词

# create.words.emptyHint
source: Tap + to add words, or leave empty for an appreciation card.
zh_hans: 点 + 添加生词；留空则生成句子赏析卡。

# create.words.footer
source: Tap × on a tag to remove a word.
zh_hans: 点击标签上的 × 可移除生词。

# create.workspace.appreciation
source: Appreciation
zh_hans: 句子赏析

# create.workspace.vocabulary
source: Vocabulary
zh_hans: 生词制卡

# deck.actions.footer
source: %d deck(s) selected for export. Import reads deck info from the file and merges automatically.
zh_hans: 已选 %d 个词库用于导出。导入会读取文件中的词库信息并自动合并。

# deck.actions.importFooter
source: Import uses deck info from the file when available. Otherwise select one or more decks first. Export requires a selection.
zh_hans: 文件含词库信息时自动导入；否则请先选择一个或多个词库。导出需先选择词库。

# deck.actions.section
source: Import & Export
zh_hans: 导入 / 导出

# deck.app.exportAllApkg
source: Export all Anki
zh_hans: 导出全部 Anki

# deck.app.restoreBackup
source: Restore all
zh_hans: 恢复全部

# deck.app.saveBackup
source: Save all
zh_hans: 保存全部

# deck.appBackup.footer
source: Full-app backup: all decks, cards, and SRS progress. Restore replaces or merges everything — not tied to the selected deck.
zh_hans: 全 App 备份：含所有词库、卡片与复习进度。恢复时合并或覆盖全部数据，与上方选中的词库无关。

# deck.appBackup.section
source: All decks
zh_hans: 全部词库

# deck.backup.footer
source: %d cards total. JSON backup keeps decks, SRS data, and review progress. .apkg exports all cards for Anki.
zh_hans: 共 %d 张卡。JSON 备份含词库、SRS 与复习进度；.apkg 导出全部卡片供 Anki 使用。

# deck.backup.section
source: Backup & Export
zh_hans: 备份与导出

# deck.browsePresets
source: Browse Decks
zh_hans: 浏览词库

# deck.catalog.heroLead
source: Original-book decks · exams & periodicals · ready to study
zh_hans: 海量原版书籍词库｜考研 / 雅思 / 外刊｜即选即学

# deck.catalog.memberBadge
source: Pro packs
zh_hans: 会员专属词库包

# deck.catalog.subtitle
source: Open-source packs and community imports
zh_hans: 开源词库与社区导入，持续扩充

# deck.catalog.title
source: More decks
zh_hans: 获取更多词库

# deck.clear
source: Clear
zh_hans: 清空

# deck.clear.complete
source: Deck cleared
zh_hans: 已清空

# deck.clear.failed
source: Clear failed
zh_hans: 清空失败

# deck.clear.message
source: All cards in “%@” will be permanently deleted. The deck itself will remain.
zh_hans: 将永久删除「%@」中的所有卡片，词库本身会保留。

# deck.clear.result
source: Removed %2$d cards from “%1$@”.
zh_hans: 已从「%1$@」移除 %2$d 张卡片。

# deck.clear.title
source: Clear deck contents?
zh_hans: 清空词库内容？

# deck.community.advancedVocab.detail
source: Words, phrasal verbs, and idioms for upper-intermediate learners.
zh_hans: 中高级词汇、短语动词与习语。

# deck.community.advancedVocab.name
source: Advanced English Vocabulary
zh_hans: 进阶英语词汇

# deck.community.english60k.detail
source: Large frequency-sorted deck with definitions and audio.
zh_hans: 按词频排序的大型词库，含释义与发音。

# deck.community.english60k.name
source: English 60K High Frequency
zh_hans: 英语 6 万高频词

# deck.community.estimatedCards
source: ~%lld cards
zh_hans: 约 %lld 张

# deck.community.footer
source: Opens AnkiWeb in Safari. Download the .apkg, then import it in KnoWell. Community decks are shared by users; check each deck's license.
zh_hans: 在 Safari 打开 AnkiWeb 下载 .apkg，再回到 KnoWell 导入。社区词库由用户分享，请注意各 deck 的使用条款。

# deck.community.greSearch.detail
source: Search AnkiWeb for GRE 3000 and other GRE decks.
zh_hans: 在 AnkiWeb 搜索 GRE 3000 等 GRE 词库。

# deck.community.greSearch.name
source: Browse GRE Decks
zh_hans: 浏览 GRE 词库

# deck.community.ielts4000.detail
source: Popular IELTS deck with IPA on AnkiWeb.
zh_hans: AnkiWeb 热门雅思 deck，含音标。

# deck.community.ielts4000.name
source: 4000 IELTS Words
zh_hans: 4000 雅思词汇

# deck.community.importGuide
source: How to import .apkg
zh_hans: 如何导入 .apkg

# deck.community.importGuide.body
source: 1. Tap Open on a community deck and download the .apkg on AnkiWeb. 2. Save it to Files on your iPhone. 3. Return here and tap Import Anki Package, or use the button below.
zh_hans: 1. 点击「打开」在 AnkiWeb 下载 .apkg。 2. 保存到 iPhone「文件」App。 3. 回到此处点击「导入 Anki 包」，或点下方按钮直接选择文件。

# deck.community.importGuide.title
source: Import Anki Package
zh_hans: 导入 Anki 包

# deck.community.importNow
source: Import Now
zh_hans: 立即导入

# deck.community.openAnkiWeb
source: Open
zh_hans: 打开

# deck.community.section
source: Community Decks (AnkiWeb)
zh_hans: 社区词库（AnkiWeb）

# deck.community.toeflSearch.detail
source: Search AnkiWeb for TOEFL vocabulary decks.
zh_hans: 在 AnkiWeb 搜索托福词汇 deck。

# deck.community.toeflSearch.name
source: Browse TOEFL Decks
zh_hans: 浏览 TOEFL 词库

# deck.communitySearch.section
source: Community search
zh_hans: 社区检索

# deck.create.title
source: New Deck
zh_hans: 新建词库

# deck.dailyReflection.detail
source: Appreciation cards saved from Daily Lines
zh_hans: 从「今日一句」收藏的赏析卡

# deck.dailyReflection.name
source: Daily Lines
zh_hans: 每日一句

# deck.default.badge
source: Default
zh_hans: 默认

# deck.default.detail
source: Cards not assigned to another deck
zh_hans: 未指定其他词库的卡片会放在这里

# deck.default.name
source: General
zh_hans: 默认词库

# deck.delete
source: Delete
zh_hans: 删除

# deck.delete.failed
source: Could Not Delete Deck
zh_hans: 删除词库失败

# deck.deselectAll
source: Clear
zh_hans: 取消全选

# deck.detail.placeholder
source: Description (optional)
zh_hans: 简介（可选）

# deck.directDownload.section
source: Direct download
zh_hans: 可直接下载

# deck.download.emptyPack
source: Downloaded pack contains no cards.
zh_hans: 下载的词库包没有卡片。

# deck.download.failed
source: Download Failed
zh_hans: 下载失败

# deck.download.invalidResponse
source: Invalid response from the download server.
zh_hans: 下载服务器返回无效响应。

# deck.download.networkFailed
source: Network error: %@
zh_hans: 网络错误：%@

# deck.download.starter
source: Download
zh_hans: 下载

# deck.downloading
source: Downloading…
zh_hans: 下载中…

# deck.due.meterA11y
source: %lld of %lld cards due
zh_hans: %lld / %lld 张待复习

# deck.due.short
source: %lld due
zh_hans: %lld 待复

# deck.dueCards.short
source: due
zh_hans: 待复

# deck.edit
source: Edit
zh_hans: 编辑

# deck.edit.failed
source: Edit Failed
zh_hans: 编辑失败

# deck.edit.title
source: Edit Deck
zh_hans: 编辑词库

# deck.empty
source: No decks yet
zh_hans: 还没有词库

# deck.error.cannotDeleteDefault
source: The default deck cannot be deleted
zh_hans: 默认词库不能删除

# deck.error.invalidName
source: Deck name cannot be empty
zh_hans: 词库名称不能为空

# deck.error.missingStarterPack
source: Starter pack not found in the app bundle.
zh_hans: 未找到内置 starter 词库包。

# deck.error.unknownPreset
source: Unknown preset deck
zh_hans: 未知推荐词库

# deck.export.apkg
source: Export apkg
zh_hans: 导出 apkg

# deck.export.checkedJSONResult
source: Exported cards from %d deck(s).
zh_hans: 已导出 %d 个词库中的卡片。

# deck.export.needSelection
source: Select at least one deck to export.
zh_hans: 请至少选择一个词库再导出。

# deck.extension.emptyCatalog
source: Deck list not synced yet
zh_hans: 词库列表尚未同步

# deck.extension.emptyCatalogHint
source: Open KnoWell once, then try Share again.
zh_hans: 请先打开 KnoWell 主 App 一次，再使用共享制卡。

# deck.extension.footer
source: Matches the deck selected in the main app. Open KnoWell to manage decks.
zh_hans: 与主 App 制卡页的目标词库同步。可在 KnoWell 中管理词库。

# deck.filter.all
source: All
zh_hans: 全部

# deck.import.apkg
source: Import Anki Package (.apkg)
zh_hans: 导入 Anki 包 (.apkg)

# deck.import.apkgIncompleteResult
source: %2$d cards with incomplete fields → “%1$@”.
zh_hans: %2$d 张字段不完整的卡片 → 「%1$@」。

# deck.import.apkgMultiResult
source: Imported %2$d Anki cards across %1$d decks.
zh_hans: 已从 Anki 包导入 %2$d 张卡片，涉及 %1$d 个词库。

# deck.import.apkgResult
source: Imported %2$d Anki cards into %1$@.
zh_hans: 已向「%1$@」导入 %2$d 张 Anki 卡片。

# deck.import.apkgUnmappedResult
source: %2$d cards without deck info → “%1$@”.
zh_hans: %2$d 张无词库信息的卡片 → 「%1$@」。

# deck.import.complete
source: Import Complete
zh_hans: 导入完成

# deck.import.deckFooter
source: Add cards from a deck pack (.json) or Anki package (.apkg) into the selected deck.
zh_hans: 将词库包（.json）或 Anki 包（.apkg）导入到当前选中的词库。

# deck.import.deckJSONResult
source: Imported into %1$@: %2$d added, %3$d updated.
zh_hans: 已导入「%1$@」：新增 %2$d 张，更新 %3$d 张。

# deck.import.deckSection
source: Import into Deck
zh_hans: 导入到词库

# deck.import.emptyCardPlaceholder
source: (Empty card)
zh_hans: （空卡片）
